{
  "CoutCredit": {
    "title": "Calculate the total cost of your loan in a few clicks",
    "intro": "Estimate the total cost of your loan in a few clicks.",
    "disclaimer": "This result is an indicative estimate; actual fees may vary depending on your situation and your bank.",
    "amountLabel": "Loan amount (€):",
    "rateLabel": "Annual interest rate (%):",
    "yearsLabel": "Term (years):",
    "insuranceLabel": "Annual insurance (%):",
    "indicative": "Results are given for information only.",
    "learnMore": "Learn more",
    "calculate": "Calculate",
    "resultLabel": "Result:",
    "costLabel": "Total loan cost:",
    "totalLabel": "Total amount to be repaid (loan + interest + insurance):",
    "whatTitle": "What is the loan cost simulator?",
    "whatDesc": "The loan cost simulator allows you to estimate the total cost of your loan based on the amount borrowed, the interest rate, the loan term, and insurance. It helps you better understand the impact of your loan on your long-term finances.",
    "howTitle": "How does the loan cost simulator work?",
    "howDesc": "The simulator uses a simple formula to estimate the total cost of your loan based on the amount borrowed, the interest rate, the loan term, and insurance. The calculation is as follows:",
    "formula1": "Total loan cost = (Loan amount * Annual interest rate / 12) / (1 - (1 + Annual interest rate / 12)^(-Term * 12))",
    "formula2": "Total cost = Monthly payment amount * Number of payments",
    "insuranceDesc": "Then, the total cost of insurance is added. This calculation is as follows:",
    "insuranceFormula": "Total insurance cost = Loan amount * Annual insurance rate * Loan term",
    "exampleTitle": "Example:",
    "example1": "Monthly payment = (10,000 * 5% / 12) / (1 - (1 + 5% / 12)^(-10 * 12)) = €106.07 (monthly payment)",
    "example2": "Total cost = 106.07 * 120 = €12,728.40",
    "example3": "Insurance cost = 10,000 * 0.5% * 10 = €500",
    "example4": "Total to be repaid = €12,728.40 + €500 = €13,228.40",
    "whyTitle": "What is the purpose of the loan cost simulator?",
    "whyList_0_title": "Estimate loan expenses:",
    "whyList_0_desc": "It helps you estimate your annual loan costs and better plan your finances.",
    "whyList_1_title": "Visualize the impact of your loan:",
    "whyList_1_desc": "You can adjust the amount borrowed, the interest rate, or the loan term to see how this affects your monthly payments and the total cost.",
    "whyList_2_title": "Help reduce costs:",
    "whyList_2_desc": "This simulator allows you to compare different loan options and optimize your borrowing according to your budget.",
    "reduceTitle": "How to reduce the cost of your loan?",
    "reduceList_0_title": "Reduce the loan term:",
    "reduceList_0_desc": "The shorter the term, the faster you repay and the less interest you pay.",
    "reduceList_1_title": "Choose a lower interest rate:",
    "reduceList_1_desc": "Compare offers from different lenders to get a better interest rate.",
    "reduceList_2_title": "Opt for cheaper insurance:",
    "reduceList_2_desc": "See if you can find a better borrower insurance offer that reduces the total cost.",
    "reduceList_3_title": "Repay early:",
    "reduceList_3_desc": "If possible, repay part of your loan earlier to reduce the total amount of interest.",
    "faqTitle": "FAQ - Frequently asked questions about the loan cost simulator",
    "faq_0_question": "What is the purpose of the loan cost simulator?",
    "faq_0_answer": "The loan cost simulator helps you estimate the total cost of your loan, including interest and insurance, so you can better anticipate the total amount to be repaid.",
    "faq_1_question": "What does the total cost include?",
    "faq_1_answer": "The total cost of the loan includes the interest paid over the term of the loan as well as, where applicable, the cost of borrower insurance. It may also include certain ancillary fees depending on the institution.",
    "faq_2_question": "Longer term = less interest?",
    "faq_2_answer": "No, the longer the loan term, the higher the total amount of interest paid, even if the monthly payment decreases.",
    "faq_3_question": "Is insurance mandatory?",
    "faq_3_answer": "Borrower insurance is not always mandatory, but it is very often required by banks for mortgages. It guarantees repayment of the loan in the event of a serious problem.",
    "faq_4_question": "What information do I need to run a simulation?",
    "faq_4_answer": "Enter the amount borrowed, the annual interest rate, the loan term in years, and, if necessary, your borrower insurance rate.",
    "faq_5_question": "Are my data saved?",
    "faq_5_answer": "No, the simulator does not store your data. No personal information is recorded. Be sure to note your results if you wish to keep them.",
    "faq_6_question": "How do I read the simulator results?",
    "faq_6_answer": "The simulator displays the total cost of the loan (interest + insurance) as well as the total amount to be repaid (amount borrowed + loan cost). This allows you to compare different borrowing options."
  },
  "DCA": {
    "title": "DCA Simulator (recurring purchase)",
    "intro": "Simulate progressive investment (DCA) on an asset by making regular purchases.",
    "disclaimer": "Indicative result, does not replace financial advice nor predict actual market evolution.",
    "amountLabel": "Amount invested per period (€):",
    "prixInitialLabel": "Initial asset price (€):",
    "prixFinalLabel": "Final asset price (€):",
    "periodesLabel": "Number of periods:",
    "calculate": "Calculate",
    "resultLabel": "Result:",
    "totalInvestiLabel": "Total invested:",
    "valeurFinaleLabel": "Final value:",
    "perfLabel": "Absolute performance:",
    "perfPctLabel": "Relative performance:",
    "prixMoyenLabel": "Average purchase price:",
    "faqTitle": "FAQ - DCA (recurring purchase)",
    "faq_0_question": "What is DCA (Dollar Cost Averaging)?",
    "faq_0_answer": "DCA means investing a fixed amount at regular intervals, regardless of price variation, to smooth the average purchase price over time.",
    "faq_1_question": "What parameters are taken into account in the simulation?",
    "faq_1_answer": "The amount invested per period, frequency, duration, and the evolution of the asset price (historical or hypothetical).",
    "faq_2_question": "Does the simulator take fees into account?",
    "faq_2_answer": "No, this simulator does not take into account any transaction or purchase fees.",
    "faq_3_question": "Does DCA guarantee a profit?",
    "faq_3_answer": "No, DCA does not guarantee a profit but helps limit risks related to market volatility."
  },
  "ConversionDevises": {
    "title": "Currency converter",
    "intro": "Quickly convert major world currencies with up-to-date rates.",
    "disclaimer": "Indicative result, does not replace an official bank rate.",
    "amountLabel": "Amount:",
    "fromLabel": "From:",
    "toLabel": "To:",
    "convert": "Convert",
    "converting": "Converting...",
    "resultLabel": "Result:",
    "faqTitle": "FAQ - Currency converter",
    "faq_0_question": "Which currencies can I convert?",
    "faq_0_answer": "Major world currencies are available (EUR, USD, GBP, CHF, JPY, etc.).",
    "faq_1_question": "Are the rates real-time?",
    "faq_1_answer": "Rates are updated regularly but may differ slightly from exact bank rates.",
    "faq_2_question": "Are any fees included?",
    "faq_2_answer": "No, this converter does not take into account any exchange fees your bank may charge."
  },
  "HomePage": {
    "title": "Hello world!",
    "about": "Go to the about page"
  },
  "ROI": {
    "title": "Easily calculate your investment return",
    "intro": "Calculate the return on your investment based on the amount invested and the gains achieved.",
    "disclaimer": "Simplified indicator; does not replace a full analysis.",
    "investedLabel": "Amount invested (€):",
    "gainsLabel": "Gains achieved (€):",
    "resultLabel": "Result:",
    "yieldLabel": "Return:",
    "calculate": "Calculate",
    "indicative": "⚠️ Results are given for information only.",
    "learnMore": "Learn more",
    "howTitle": "How to calculate the return on an investment?",
    "howDesc": "Calculating return is essential to assess the profitability of an investment. It shows how much gain an asset generates compared to its initial cost. This applies to various types of investments, such as real estate, stocks, or business assets.",
    "howCalcTitle": "How is it calculated?",
    "howCalcDesc": "There are different ways to calculate the return on an investment:",
    "grossYield": "Gross return",
    "grossYieldDesc": "the return is calculated before taking into account certain costs (such as taxes or charges).",
    "netYield": "Net return",
    "netYieldDesc": "the return takes into account charges, taxes, and other costs to give a more accurate picture of actual profitability.",
    "grossFormula": "Gross return = (Gains / Purchase cost) × 100",
    "grossExampleTitle": "Example:",
  "grossExampleList_0": "Purchase cost: €100,000",
  "grossExampleList_1": "Annual gains: €8,000",
    "grossExampleResult": "Gross return = (8,000 / 100,000) × 100 = 8%",
    "grossExampleDesc": "In this example, the gross return is 8%, which means the asset generates annual income equivalent to 8% of its purchase price.",
    "netFormula": "Net return = (Gains - Costs) / Purchase cost × 100",
    "netExampleTitle": "Example:",
  "netExampleList_0": "Purchase cost: €100,000",
  "netExampleList_1": "Annual gains: €8,000",
  "netExampleList_2": "Annual costs (charges, taxes, etc.): €1,500",
    "netExampleResult": "Net return = (8,000 - 1,500) / 100,000 × 100 = 6.5%",
    "netExampleDesc": "The net return in this example is 6.5%, which is more accurate as it takes into account the actual expenses associated with the asset.",
    "whyTitle": "Why use the calculation of an asset's return?",
    "whyDesc": "Calculating the return on an asset is essential for making informed investment decisions. It allows you to compare different assets or investments to choose the one that offers the best return on investment.",
    "practicalTitle": "Practical applications of return calculation",
  "practicalList_0": "Real estate investments: Calculating the return on a property lets you know if buying a property is profitable based on its rental income.",
  "practicalList_1": "Stock investments: Calculating the return on a stock portfolio measures the profitability of dividends and capital gains.",
  "practicalList_2": "Business valuations: Return can also be used to assess the profitability of a business asset.",
    "whyUseTitle": "Why use this calculation?",
  "whyUseList_0": "Assess profitability: Return lets you know the profitability of an investment compared to its initial cost.",
  "whyUseList_1": "Compare investment options: By calculating the return of different assets, you can make a more informed choice based on your investment objective.",
  "whyUseList_2": "Optimize investments: Calculating return allows you to adjust investment strategies to maximize profits and minimize risks.",
    "faqTitle": "FAQ - Frequently asked questions about return calculation",
  "faq_0_question": "How to calculate the return on an investment?",
  "faq_0_answer": "The return on an investment is calculated by dividing the net gain generated by the initial amount invested, then multiplying by 100 to get a percentage. Our investment return simulator helps you easily estimate this rate.",
  "faq_1_question": "Why calculate the return on your investment?",
  "faq_1_answer": "Calculating the return on an investment allows you to measure the real profitability of your investment and compare different options such as stocks, real estate, or savings to optimize your gains.",
  "faq_2_question": "What is a good rate of return?",
  "faq_2_answer": "A good rate of return depends on the type of investment and the associated risk. For example, a return of 4 to 7% is often considered attractive for real estate, while stocks can offer higher but more volatile returns.",
  "faq_3_question": "Should taxes be included in the return calculation?",
  "faq_3_answer": "Yes, the net return on an investment should include any taxes and fees to reflect the real profitability of your investment. Our return calculator allows you to estimate this amount more precisely.",
  "faq_4_question": "What is the difference between return and capital gain?",
  "faq_4_answer": "Return refers to the regular income generated by an investment (dividends, rent), while capital gain is the profit made when selling the asset at a price higher than its purchase price.",
  "faq_5_question": "Difference between ROI/IRR?",
  "faq_5_answer": "ROI (Return On Investment) measures the total profitability of an investment over a given period, without taking duration into account. IRR (Internal Rate of Return) considers the timing of cash flows and allows you to compare investments of different durations.",
  "faq_6_question": "What should be included in costs?",
  "faq_6_answer": "Costs should include all amounts invested: purchase price, acquisition fees, work, management fees, taxes, charges, etc. The more accurate the estimate, the more reliable the return calculation will be.",
  "faq_7_question": "Negative ROI?",
  "faq_7_answer": "A negative ROI means your investment has generated a loss: costs exceed gains. This can happen if income is insufficient or if the value of the asset decreases."
  },
  "Amortissement": {
    "title": "Amortization schedule and impact of early repayments",
    "intro": "Simulate your loan, view the amortization table and the impact of early repayments.",
    "disclaimer": "Indicative result, does not replace financial advice.",
    "montantLabel": "Loan amount (€):",
    "tauxLabel": "Annual rate (%):",
    "dureeLabel": "Duration (years):",
    "assuranceLabel": "Monthly insurance (€) (optional):",
    "moisRembLabel": "Month of early repayment:",
    "montantRembLabel": "Amount of early repayment (€):",
    "ajouterRemb": "Add early repayment",
    "remboursements": "Early repayments:",
    "calculer": "Calculate",
    "resume": "Summary",
    "dureeReelle": "Actual duration:",
    "totalInterets": "Total interest:",
    "totalAssurance": "Total insurance:",
    "mois": "Month",
    "mensualite": "Monthly payment (€)",
    "interets": "Interest",
    "capitalRemb": "Principal repaid",
    "assurance": "Insurance",
    "capitalRestant": "Remaining principal",
    "faqTitle": "FAQ - Amortization and early repayments",
    "faq_0_question": "How is the amortization table calculated?",
    "faq_0_answer": "The amortization table is calculated using the standard method: each payment includes an interest and a principal part, recalculated after each early repayment.",
    "faq_1_question": "Can I simulate several early repayments?",
    "faq_1_answer": "Yes, you can add several early repayments at different dates to see their impact on the loan duration and total cost.",
    "faq_2_question": "What is the impact of an early repayment?",
    "faq_2_answer": "An early repayment reduces the remaining principal: it can shorten the loan duration or reduce the monthly payment, depending on the chosen option."
  },
  "CapaciteEmprunt": {
    "title": "Calculate your borrowing capacity",
    "intro": "Estimate the amount you can borrow based on your income, expenses, target debt ratio, interest rate, loan term, and insurance.",
    "disclaimer": "Indicative estimate; does not replace actual conditions.",
    "revenusLabel": "Net monthly income (€):",
    "chargesLabel": "Monthly expenses (€):",
    "tauxEndettementLabel": "Target debt ratio (%):",
    "tauxAnnuelLabel": "Annual rate (%):",
    "dureeLabel": "Term (years):",
    "assuranceLabel": "Monthly borrower insurance (€):",
    "indicative": "⚠️ Results are given for information only.",
    "learnMore": "Learn more",
    "calculer": "Calculate",
    "resultLabel": "Results:",
    "mensualiteMaxLabel": "Maximum monthly payment:",
    "capitalMaxLabel": "Borrowable amount:",
    "howTitle": "How to calculate your borrowing capacity?",
    "howDesc": "Borrowing capacity is the maximum amount you can borrow based on your income, expenses, target debt ratio, interest rate, loan term, and insurance cost. This calculation helps you define your budget for a real estate project or any other loan.",
    "formulaTitle": "Calculation formula",
    "formula1": "Max monthly payment = Income × Target debt ratio - Expenses - Insurance",
    "formula2": "Borrowable amount = Max monthly payment × [1 - (1 + r)^-n] / r",
    "formula3": "r = annual rate / 12 ; n = 12 × term (years)",
    "example1": "Example: Income = €3,500, Expenses = €400, Debt ratio = 35%, Annual rate = 4%, Term = 20 years",
    "example2": "Max monthly payment = 3,500 × 0.35 - 400 = €825",
    "example3": "r = 0.04 / 12 = 0.00333 ; n = 240",
    "example4": "Borrowable amount ≈ 825 × [1 - (1 + 0.00333)^-240] / 0.00333 ≈ €136,143",
    "example5": "In this example, you can borrow about €136,143 over 20 years with a maximum monthly payment of €825.",
    "faqTitle": "FAQ - Frequently asked questions about borrowing capacity",
    "faq_0_question": "Why is the target debt ratio often set at 35%?",
    "faq_0_answer": "The 35% debt ratio is a common benchmark used by French banks to limit the risk of over-indebtedness. It corresponds to the maximum share of your net income that can be devoted to loan repayments. This threshold may vary depending on profiles and institutions.",
    "faq_1_question": "Should rent be included in monthly expenses?",
    "faq_1_answer": "Yes, if you are a tenant, rent must be included in monthly expenses. If you are buying your main residence and the loan will replace the rent, it can be excluded from the calculation.",
    "faq_2_question": "What is the impact of the loan term on borrowing capacity?",
    "faq_2_answer": "The longer the loan term, the higher the maximum monthly payment allows you to borrow. However, a longer term also increases the total cost of the loan due to interest.",
    "faq_3_question": "Is borrower insurance mandatory?",
    "faq_3_answer": "Borrower insurance is not legally mandatory, but it is systematically required by banks to cover risks of death, disability, or incapacity. Its cost must be included in the calculation of the maximum monthly payment.",
    "faq_4_question": "Can I borrow more if I have few expenses?",
    "faq_4_answer": "Yes, the fewer monthly expenses you have, the higher your borrowing capacity, as a greater share of your income can be devoted to loan repayment."
  },
  "ImpactInflation": {
    "title": "Impact of inflation: present vs future value",
    "intro": "Calculate the future or past value of an amount taking into account average annual inflation.",
    "disclaimer": "Indicative result, does not replace professional financial analysis.",
    "modeFuture": "Calculate future value",
    "modePresent": "Calculate present value",
    "valeurAujLabel": "Present value (€):",
    "valeurFuturLabel": "Future value (€):",
    "inflationLabel": "Average annual inflation rate (%):",
    "anneesLabel": "Number of years:",
    "calculate": "Calculate",
    "resultLabel": "Result:",
    "resultFuture": "Equivalent value in {years} year(s)",
    "resultPresent": "Equivalent value today",
    "errorValeur": "Please enter a valid value.",
    "errorInflation": "Please enter a valid inflation rate.",
    "errorAnnees": "Please enter a valid number of years.",
    "faqTitle": "FAQ - Impact of inflation",
    "faq_0_question": "How is the future or past value calculated?",
    "faq_0_answer": "The future value is calculated by applying the compound inflation rate over the chosen period. The formula used is: future value = present value × (1 + inflation) ^ number of years.",
    "faq_1_question": "Should the inflation rate be annual?",
    "faq_1_answer": "Yes, the inflation rate is expressed as an average annual percentage.",
    "faq_2_question": "Can you calculate the present value from a future value?",
    "faq_2_answer": "Yes, just enter a future value and calculate the equivalent value today using the same formula in reverse.",
    "faq_3_question": "Does this simulator take real inflation variations into account?",
    "faq_3_answer": "No, this is an estimate based on a constant average rate. Real variations may differ from the simulation."
  
  }
}