{
  "HomePage": {
    "title": "Bonjour le monde!",
    "about": "Allez à la page à propos"
  },
  "ROI": {
    "title": "Calculez facilement le rendement de votre investissement",
    "intro": "Calculez le rendement de votre investissement en fonction du montant investi et des gains réalisées.",
    "disclaimer": "Indicateur simplifié ; ne remplace pas une analyse complète.",
    "investedLabel": "Montant investi (€) :",
    "gainsLabel": "Gains réalisés (€) :",
    "resultLabel": "Résultat :",
    "yieldLabel": "Rendement :",
    "calculate": "Calculer",
    "indicative": "⚠️ Les résultats sont donnés à titre indicatif.",
    "learnMore": "En savoir plus",
    "howTitle": "Comment calculer le rendement d'un investissement ?",
    "howDesc": "Le calcul du rendement est essentiel pour évaluer la rentabilité d'un investissement. Il permet de savoir combien de gains un bien génère par rapport à son coût initial. Cela peut s'appliquer à divers types d'investissements, tels que l'immobilier, les actions, ou les biens d'entreprise.",
    "howCalcTitle": "Comment est-ce calculé ?",
    "howCalcDesc": "Il existe différentes façons de calculer le rendement d'un investissement :",
    "grossYield": "Rendement brut",
    "grossYieldDesc": "le rendement est calculé avant la prise en compte de certains frais (comme les impôts ou les charges).",
    "netYield": "Rendement net",
    "netYieldDesc": "le rendement prend en compte les charges, impôts, et autres coûts pour donner une image plus précise de la rentabilité réelle.",
    "grossFormula": "Rendement brut = (Gains / Coût d'achat) × 100",
    "grossExampleTitle": "Exemple :",
  "grossExampleList_0": "Coût d'achat : 100 000 €",
  "grossExampleList_1": "Gains annuels : 8 000 €",
    "grossExampleResult": "Rendement brut = (8 000 / 100 000) × 100 = 8 %",
    "grossExampleDesc": "Dans cet exemple, le rendement brut est de 8 %, ce qui signifie que le bien génère un revenu annuel équivalent à 8 % de son prix d'achat.",
    "netFormula": "Rendement net = (Gains - Frais) / Coût d'achat × 100",
    "netExampleTitle": "Exemple :",
  "netExampleList_0": "Coût d'achat : 100 000 €",
  "netExampleList_1": "Gains annuels : 8 000 €",
  "netExampleList_2": "Frais annuels (charges, impôts, etc.) : 1 500 €",
    "netExampleResult": "Rendement net = (8 000 - 1 500) / 100 000 × 100 = 6,5 %",
    "netExampleDesc": "Le rendement net dans cet exemple est de 6,5 %, ce qui est plus précis, car il tient compte des dépenses réelles associées au bien.",
    "whyTitle": "Pourquoi utiliser le calcul du rendement d'un bien ?",
    "whyDesc": "Calculer le rendement d'un bien est essentiel pour prendre des décisions éclairées sur les investissements. Cela permet de comparer différents biens ou investissements afin de choisir celui qui offre le meilleur retour sur investissement.",
    "practicalTitle": "Applications pratiques du calcul du rendement",
  "practicalList_0": "Investissements immobiliers : Calculer le rendement d'un bien immobilier permet de savoir si l'achat d'un bien est rentable en fonction de ses revenus locatifs.",
  "practicalList_1": "Investissements en actions : Calculer le rendement d'un portefeuille d'actions permet de mesurer la rentabilité des dividendes et des gains en capital.",
  "practicalList_2": "Évaluations d'entreprise : Le rendement peut également être utilisé pour évaluer la rentabilité d'un bien ou d'un actif d'entreprise.",
    "whyUseTitle": "Pourquoi utiliser ce calcul ?",
  "whyUseList_0": "Évaluer la rentabilité : Le rendement permet de connaître la rentabilité d'un investissement en comparaison de son côut initial.",
  "whyUseList_1": "Comparer des options d'investissement : En calculant le rendement de différents biens, on peut faire un choix plus judicieux en fonction de l'objectif d'investissement.",
  "whyUseList_2": "Optimiser les investissements : Calculer le rendement permet d'ajuster les stratégies d'investissement pour maximiser les profits et minimiser les risques.",
    "faqTitle": "FAQ - Questions fréquentes sur le calcul du rendement d’investissement",
  "faq_0_question": "Comment calculer le rendement d’un investissement ?",
  "faq_0_answer": "Le calcul du rendement d’un investissement se fait en divisant le gain net généré par le montant investi initialement, puis en multipliant par 100 pour obtenir un pourcentage. Notre simulateur de rendement d’investissement vous aide à estimer ce taux facilement.",
  "faq_1_question": "Pourquoi calculer le rendement de son investissement ?",
  "faq_1_answer": "Calculer le rendement d’un investissement permet de mesurer la rentabilité réelle de votre placement et de comparer différentes options comme les actions, l’immobilier ou l’épargne pour optimiser vos gains.",
  "faq_2_question": "Qu’est-ce qu’un bon taux de rendement ?",
  "faq_2_answer": "Un bon taux de rendement dépend du type d’investissement et du risque associé. Par exemple, un rendement de 4 à 7 % est souvent considéré comme intéressant pour l’immobilier, tandis que les actions peuvent offrir des rendements plus élevés mais plus volatils.",
  "faq_3_question": "Faut-il prendre en compte les impôts dans le calcul du rendement ?",
  "faq_3_answer": "Oui, le rendement net d’un investissement doit inclure les impôts et frais éventuels pour refléter la rentabilité réelle de votre placement. Notre calculateur de rendement vous permet d’estimer ce montant plus précisément.",
  "faq_4_question": "Quelle est la différence entre rendement et plus-value ?",
  "faq_4_answer": "Le rendement désigne le revenu régulier généré par un investissement (dividendes, loyers), tandis que la plus-value correspond au gain réalisé lors de la revente de l’actif à un prix supérieur à son prix d’achat.",
  "faq_5_question": "Différence ROI/TRI ?",
  "faq_5_answer": "Le ROI (Return On Investment) mesure la rentabilité totale d’un investissement sur une période donnée, sans prendre en compte la durée. Le TRI (Taux de Rendement Interne) tient compte de la chronologie des flux de trésorerie et permet de comparer des investissements de durées différentes.",
  "faq_6_question": "Que mettre dans coûts ?",
  "faq_6_answer": "Dans les coûts, il faut inclure tous les montants investis : prix d’achat, frais d’acquisition, travaux, frais de gestion, impôts, charges, etc. Plus l’estimation est précise, plus le calcul du rendement sera fiable.",
  "faq_7_question": "ROI négatif ?",
  "faq_7_answer": "Un ROI négatif signifie que votre investissement a généré une perte : les coûts sont supérieurs aux gains. Cela peut arriver si les revenus sont insuffisants ou si la valeur de l’actif baisse."
  },
  "Amortissement": {
    "title": "Tableau d’amortissement et impact des remboursements anticipés",
    "intro": "Simulez votre prêt, visualisez le tableau d’amortissement et l’impact de remboursements anticipés.",
    "disclaimer": "Résultat indicatif, ne remplace pas un conseil financier.",
    "montantLabel": "Montant du prêt (€) :",
    "tauxLabel": "Taux annuel (%) :",
    "dureeLabel": "Durée (années) :",
    "assuranceLabel": "Assurance mensuelle (€) (optionnel) :",
    "moisRembLabel": "Mois du remboursement anticipé :",
    "montantRembLabel": "Montant du remboursement anticipé (€) :",
    "ajouterRemb": "Ajouter remboursement anticipé",
    "remboursements": "Remboursements anticipés :",
    "calculer": "Calculer",
    "resume": "Résumé",
    "dureeReelle": "Durée réelle :",
    "totalInterets": "Total intérêts :",
    "totalAssurance": "Total assurance :",
    "mois": "Mois",
    "mensualite": "Mensualité (€)",
    "interets": "Intérêts",
    "capitalRemb": "Capital remboursé",
    "assurance": "Assurance",
    "capitalRestant": "Capital restant",
    "faqTitle": "FAQ - Amortissement et remboursements anticipés",
    "faq_0_question": "Comment est calculé le tableau d’amortissement ?",
    "faq_0_answer": "Le tableau d’amortissement est calculé selon la méthode classique : chaque échéance comprend une part d’intérêts et une part de capital, recalculées à chaque remboursement anticipé.",
    "faq_1_question": "Peut-on simuler plusieurs remboursements anticipés ?",
    "faq_1_answer": "Oui, vous pouvez ajouter plusieurs remboursements anticipés à différentes dates pour voir leur impact sur la durée et le coût total du prêt.",
    "faq_2_question": "Quel est l’impact d’un remboursement anticipé ?",
    "faq_2_answer": "Un remboursement anticipé réduit le capital restant dû : il peut raccourcir la durée du prêt ou diminuer la mensualité, selon l’option choisie."
  },
  "CapaciteEmprunt": {
    "title": "Calculez votre capacité d’emprunt",
    "intro": "Estimez le capital que vous pouvez emprunter selon vos revenus, charges, taux d’endettement cible, taux d’intérêt, durée et assurance.",
    "disclaimer": "Estimation indicative ; hors conditions réelles.",
    "revenusLabel": "Revenus nets mensuels (€) :",
    "chargesLabel": "Charges mensuelles (€) :",
    "tauxEndettementLabel": "Taux d’endettement cible (%) :",
    "tauxAnnuelLabel": "Taux annuel (%) :",
    "dureeLabel": "Durée (années) :",
    "assuranceLabel": "Assurance emprunteur mensuelle (€) :",
    "indicative": "⚠️ Les résultats sont donnés à titre indicatif.",
    "learnMore": "En savoir plus",
    "calculer": "Calculer",
    "resultLabel": "Résultats :",
    "mensualiteMaxLabel": "Mensualité maximale :",
    "capitalMaxLabel": "Capital empruntable :",
    "howTitle": "Comment calculer sa capacité d’emprunt ?",
    "howDesc": "La capacité d’emprunt correspond au montant maximal que vous pouvez emprunter en fonction de vos revenus, charges, taux d’endettement cible, taux d’intérêt, durée du prêt et coût de l’assurance. Ce calcul vous aide à définir votre budget pour un projet immobilier ou tout autre crédit.",
    "formulaTitle": "Formule de calcul",
    "formula1": "Mensualité max = Revenus × Taux endettement cible - Charges - Assurance",
    "formula2": "Capital empruntable = Mensualité max × [1 - (1 + r)^-n] / r",
    "formula3": "r = taux annuel / 12 ; n = 12 × durée (années)",
    "example1": "Exemple : Revenus = 3 500 €, Charges = 400 €, Taux endettement = 35 %, Taux annuel = 4 %, Durée = 20 ans",
    "example2": "Mensualité max = 3 500 × 0,35 - 400 = 825 €",
    "example3": "r = 0,04 / 12 = 0,00333 ; n = 240",
    "example4": "Capital empruntable ≈ 825 × [1 - (1 + 0,00333)^-240] / 0,00333 ≈ 136 143 €",
    "example5": "Dans cet exemple, vous pouvez emprunter environ 136 143 € sur 20 ans avec une mensualité maximale de 825 €.",
    "faqTitle": "FAQ - Questions fréquentes sur la capacité d’emprunt",
    "faq_0_question": "Pourquoi le taux d’endettement cible est-il souvent fixé à 35 % ?",
    "faq_0_answer": "Le taux d’endettement de 35 % est une référence courante utilisée par les banques françaises pour limiter le risque de surendettement. Il correspond à la part maximale de vos revenus nets pouvant être consacrée au remboursement de vos crédits. Ce seuil peut varier selon les profils et les établissements.",
    "faq_1_question": "Faut-il inclure le loyer dans les charges mensuelles ?",
    "faq_1_answer": "Oui, si vous êtes locataire, le loyer doit être inclus dans les charges mensuelles. Si vous achetez votre résidence principale et que le prêt servira à remplacer le loyer, celui-ci peut être exclu du calcul.",
    "faq_2_question": "Quel est l’impact de la durée du prêt sur la capacité d’emprunt ?",
    "faq_2_answer": "Plus la durée du prêt est longue, plus la mensualité maximale permet d’emprunter un capital élevé. Cependant, une durée plus longue augmente aussi le coût total du crédit à cause des intérêts.",
    "faq_3_question": "L’assurance emprunteur est-elle obligatoire ?",
    "faq_3_answer": "L’assurance emprunteur n’est pas légalement obligatoire, mais elle est systématiquement exigée par les banques pour couvrir les risques de décès, invalidité ou incapacité. Son coût doit être intégré dans le calcul de la mensualité maximale.",
    "faq_4_question": "Puis-je emprunter plus si j’ai peu de charges ?",
    "faq_4_answer": "Oui, moins vous avez de charges mensuelles, plus votre capacité d’emprunt augmente, car une plus grande part de vos revenus peut être consacrée au remboursement du prêt."
  }
}